TESTRUN1-HOST0-COMPR/fio-benchmark-output/Test05-Typerandwrite-BS8k-DeviceCount05.txt
test1-subtest1-blocksize8k-threads1-device1of5: (g=0): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
test1-subtest1-blocksize8k-threads1-device2of5: (g=0): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
test1-subtest1-blocksize8k-threads1-device3of5: (g=0): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
test1-subtest1-blocksize8k-threads1-device4of5: (g=0): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
test1-subtest1-blocksize8k-threads1-device5of5: (g=0): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
test1-subtest2-blocksize8k-threads2-device1of5: (g=1): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest2-blocksize8k-threads2-device2of5: (g=1): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest2-blocksize8k-threads2-device3of5: (g=1): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest2-blocksize8k-threads2-device4of5: (g=1): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest2-blocksize8k-threads2-device5of5: (g=1): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest3-blocksize8k-threads3-device1of5: (g=2): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest3-blocksize8k-threads3-device2of5: (g=2): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest3-blocksize8k-threads3-device3of5: (g=2): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest3-blocksize8k-threads3-device4of5: (g=2): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest3-blocksize8k-threads3-device5of5: (g=2): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest4-blocksize8k-threads4-device1of5: (g=3): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest4-blocksize8k-threads4-device2of5: (g=3): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest4-blocksize8k-threads4-device3of5: (g=3): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest4-blocksize8k-threads4-device4of5: (g=3): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest4-blocksize8k-threads4-device5of5: (g=3): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest5-blocksize8k-threads5-device1of5: (g=4): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest5-blocksize8k-threads5-device2of5: (g=4): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest5-blocksize8k-threads5-device3of5: (g=4): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest5-blocksize8k-threads5-device4of5: (g=4): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest5-blocksize8k-threads5-device5of5: (g=4): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest6-blocksize8k-threads6-device1of5: (g=5): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest6-blocksize8k-threads6-device2of5: (g=5): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest6-blocksize8k-threads6-device3of5: (g=5): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest6-blocksize8k-threads6-device4of5: (g=5): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest6-blocksize8k-threads6-device5of5: (g=5): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest7-blocksize8k-threads7-device1of5: (g=6): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest7-blocksize8k-threads7-device2of5: (g=6): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest7-blocksize8k-threads7-device3of5: (g=6): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest7-blocksize8k-threads7-device4of5: (g=6): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest7-blocksize8k-threads7-device5of5: (g=6): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest8-blocksize8k-threads8-device1of5: (g=7): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest8-blocksize8k-threads8-device2of5: (g=7): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest8-blocksize8k-threads8-device3of5: (g=7): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest8-blocksize8k-threads8-device4of5: (g=7): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest8-blocksize8k-threads8-device5of5: (g=7): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest9-blocksize8k-threads9-device1of5: (g=8): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest9-blocksize8k-threads9-device2of5: (g=8): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest9-blocksize8k-threads9-device3of5: (g=8): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest9-blocksize8k-threads9-device4of5: (g=8): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest9-blocksize8k-threads9-device5of5: (g=8): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest10-blocksize8k-threads10-device1of5: (g=9): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest10-blocksize8k-threads10-device2of5: (g=9): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest10-blocksize8k-threads10-device3of5: (g=9): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest10-blocksize8k-threads10-device4of5: (g=9): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest10-blocksize8k-threads10-device5of5: (g=9): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
fio-3.12
Starting 275 processes

test1-subtest1-blocksize8k-threads1-device1of5: (groupid=0, jobs=5): err= 0: pid=4757: Sat Jan 12 08:18:02 2019
  write: IOPS=30.7k, BW=240MiB/s (252MB/s)(14.1GiB/60001msec)
    slat (nsec): min=2587, max=20651, avg=3082.96, stdev=398.27
    clat (usec): min=85, max=76954, avg=159.18, stdev=189.77
     lat (usec): min=92, max=76957, avg=162.32, stdev=189.77
    clat percentiles (usec):
     |  1.00th=[  103],  5.00th=[  109], 10.00th=[  113], 20.00th=[  123],
     | 30.00th=[  135], 40.00th=[  139], 50.00th=[  141], 60.00th=[  145],
     | 70.00th=[  147], 80.00th=[  151], 90.00th=[  163], 95.00th=[  239],
     | 99.00th=[  717], 99.50th=[ 1516], 99.90th=[ 2442], 99.95th=[ 2737],
     | 99.99th=[ 4686]
   bw (  KiB/s): min=187637, max=270894, per=99.67%, avg=244794.45, stdev=2780.70, samples=595
   iops        : min=23454, max=33861, avg=30597.82, stdev=347.56, samples=595
  lat (usec)   : 100=0.33%, 250=95.36%, 500=3.17%, 750=0.17%, 1000=0.29%
  lat (msec)   : 2=0.42%, 4=0.24%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.52%, sys=2.56%, ctx=1842426, majf=0, minf=79
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1842152,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest2-blocksize8k-threads2-device1of5: (groupid=1, jobs=10): err= 0: pid=5044: Sat Jan 12 08:18:02 2019
  write: IOPS=53.1k, BW=415MiB/s (435MB/s)(24.3GiB/60003msec)
    slat (nsec): min=2011, max=20119, avg=3521.24, stdev=797.97
    clat (usec): min=89, max=63666, avg=184.07, stdev=221.03
     lat (usec): min=94, max=63669, avg=187.65, stdev=221.03
    clat percentiles (usec):
     |  1.00th=[  106],  5.00th=[  114], 10.00th=[  120], 20.00th=[  137],
     | 30.00th=[  143], 40.00th=[  147], 50.00th=[  151], 60.00th=[  155],
     | 70.00th=[  161], 80.00th=[  172], 90.00th=[  243], 95.00th=[  293],
     | 99.00th=[ 1139], 99.50th=[ 1909], 99.90th=[ 2540], 99.95th=[ 2737],
     | 99.99th=[ 4228]
   bw (  KiB/s): min=281812, max=449974, per=84.42%, avg=358755.16, stdev=4895.18, samples=1192
   iops        : min=35224, max=56243, avg=44840.95, stdev=611.94, samples=1192
  lat (usec)   : 100=0.06%, 250=90.63%, 500=7.51%, 750=0.18%, 1000=0.38%
  lat (msec)   : 2=0.82%, 4=0.40%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.53%, sys=2.46%, ctx=3187681, majf=0, minf=158
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,3187520,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest3-blocksize8k-threads3-device1of5: (groupid=2, jobs=15): err= 0: pid=5297: Sat Jan 12 08:18:02 2019
  write: IOPS=69.0k, BW=547MiB/s (573MB/s)(32.0GiB/60001msec)
    slat (nsec): min=1994, max=149469, avg=3648.33, stdev=840.37
    clat (usec): min=89, max=67843, avg=210.02, stdev=240.09
     lat (usec): min=95, max=67847, avg=213.73, stdev=240.08
    clat percentiles (usec):
     |  1.00th=[  109],  5.00th=[  119], 10.00th=[  130], 20.00th=[  149],
     | 30.00th=[  157], 40.00th=[  165], 50.00th=[  172], 60.00th=[  178],
     | 70.00th=[  188], 80.00th=[  219], 90.00th=[  281], 95.00th=[  302],
     | 99.00th=[ 1369], 99.50th=[ 1975], 99.90th=[ 2507], 99.95th=[ 2704],
     | 99.99th=[ 4555]
   bw (  KiB/s): min=414234, max=580233, per=82.48%, avg=461761.97, stdev=1324.23, samples=1785
   iops        : min=51774, max=72522, avg=57713.61, stdev=165.51, samples=1785
  lat (usec)   : 100=0.04%, 250=85.27%, 500=12.70%, 750=0.17%, 1000=0.17%
  lat (msec)   : 2=1.17%, 4=0.46%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.51%, sys=2.29%, ctx=4199618, majf=0, minf=228
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,4198699,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest4-blocksize8k-threads4-device1of5: (groupid=3, jobs=20): err= 0: pid=5650: Sat Jan 12 08:18:02 2019
  write: IOPS=83.3k, BW=651MiB/s (682MB/s)(38.1GiB/60001msec)
    slat (nsec): min=1964, max=36272, avg=4438.78, stdev=1249.70
    clat (usec): min=89, max=81297, avg=234.94, stdev=245.85
     lat (usec): min=93, max=81302, avg=239.44, stdev=245.83
    clat percentiles (usec):
     |  1.00th=[  111],  5.00th=[  124], 10.00th=[  139], 20.00th=[  165],
     | 30.00th=[  178], 40.00th=[  186], 50.00th=[  194], 60.00th=[  208],
     | 70.00th=[  231], 80.00th=[  262], 90.00th=[  293], 95.00th=[  314],
     | 99.00th=[ 1582], 99.50th=[ 2008], 99.90th=[ 2442], 99.95th=[ 2704],
     | 99.99th=[ 5538]
   bw (  KiB/s): min=489656, max=681719, per=81.90%, avg=545686.02, stdev=1244.53, samples=2380
   iops        : min=61198, max=85207, avg=68202.07, stdev=155.56, samples=2380
  lat (usec)   : 100=0.03%, 250=76.39%, 500=21.54%, 750=0.16%, 1000=0.11%
  lat (msec)   : 2=1.28%, 4=0.48%, 10=0.02%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.54%, sys=2.42%, ctx=5001039, majf=0, minf=314
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,4997311,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest5-blocksize8k-threads5-device1of5: (groupid=4, jobs=25): err= 0: pid=5907: Sat Jan 12 08:18:02 2019
  write: IOPS=93.1k, BW=728MiB/s (763MB/s)(42.6GiB/60002msec)
    slat (nsec): min=2032, max=49165, avg=4097.51, stdev=1393.74
    clat (usec): min=73, max=73235, avg=263.53, stdev=276.90
     lat (usec): min=94, max=73238, avg=267.69, stdev=276.87
    clat percentiles (usec):
     |  1.00th=[  117],  5.00th=[  139], 10.00th=[  159], 20.00th=[  184],
     | 30.00th=[  194], 40.00th=[  204], 50.00th=[  219], 60.00th=[  235],
     | 70.00th=[  258], 80.00th=[  285], 90.00th=[  306], 95.00th=[  347],
     | 99.00th=[ 1778], 99.50th=[ 2073], 99.90th=[ 2606], 99.95th=[ 3032],
     | 99.99th=[ 5800]
   bw (  KiB/s): min=538755, max=812794, per=82.24%, avg=612839.47, stdev=2223.97, samples=2975
   iops        : min=67334, max=101586, avg=76594.95, stdev=278.02, samples=2975
  lat (usec)   : 100=0.02%, 250=67.29%, 500=29.80%, 750=0.29%, 1000=0.18%
  lat (msec)   : 2=1.79%, 4=0.60%, 10=0.02%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.48%, sys=2.14%, ctx=5595442, majf=0, minf=384
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,5589005,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest6-blocksize8k-threads6-device1of5: (groupid=5, jobs=30): err= 0: pid=6222: Sat Jan 12 08:18:02 2019
  write: IOPS=104k, BW=812MiB/s (852MB/s)(47.6GiB/60003msec)
    slat (nsec): min=2016, max=57362, avg=4719.20, stdev=1945.50
    clat (usec): min=87, max=52058, avg=283.09, stdev=275.49
     lat (usec): min=94, max=52062, avg=287.87, stdev=275.45
    clat percentiles (usec):
     |  1.00th=[  126],  5.00th=[  151], 10.00th=[  176], 20.00th=[  200],
     | 30.00th=[  212], 40.00th=[  225], 50.00th=[  239], 60.00th=[  255],
     | 70.00th=[  277], 80.00th=[  293], 90.00th=[  318], 95.00th=[  383],
     | 99.00th=[ 1827], 99.50th=[ 2073], 99.90th=[ 2737], 99.95th=[ 3097],
     | 99.99th=[ 5669]
   bw (  KiB/s): min=629197, max=860278, per=82.43%, avg=685503.92, stdev=918.99, samples=3570
   iops        : min=78638, max=107520, avg=85675.68, stdev=114.83, samples=3570
  lat (usec)   : 100=0.01%, 250=57.16%, 500=39.73%, 750=0.36%, 1000=0.13%
  lat (msec)   : 2=1.97%, 4=0.62%, 10=0.02%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.50%, sys=2.18%, ctx=6246640, majf=0, minf=461
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,6237163,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest7-blocksize8k-threads7-device1of5: (groupid=6, jobs=35): err= 0: pid=6586: Sat Jan 12 08:18:02 2019
  write: IOPS=115k, BW=901MiB/s (945MB/s)(52.8GiB/60002msec)
    slat (nsec): min=1958, max=159223, avg=4766.70, stdev=2173.59
    clat (usec): min=75, max=60608, avg=297.87, stdev=283.30
     lat (usec): min=98, max=60613, avg=302.70, stdev=283.27
    clat percentiles (usec):
     |  1.00th=[  133],  5.00th=[  161], 10.00th=[  188], 20.00th=[  212],
     | 30.00th=[  225], 40.00th=[  239], 50.00th=[  253], 60.00th=[  273],
     | 70.00th=[  289], 80.00th=[  302], 90.00th=[  334], 95.00th=[  400],
     | 99.00th=[ 1876], 99.50th=[ 2114], 99.90th=[ 2900], 99.95th=[ 3326],
     | 99.99th=[ 6128]
   bw (  KiB/s): min=632160, max=952113, per=80.62%, avg=743955.02, stdev=1912.90, samples=4167
   iops        : min=79004, max=118999, avg=92981.78, stdev=239.14, samples=4167
  lat (usec)   : 100=0.01%, 250=47.96%, 500=48.67%, 750=0.57%, 1000=0.12%
  lat (msec)   : 2=1.97%, 4=0.69%, 10=0.02%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.49%, sys=2.09%, ctx=6936735, majf=0, minf=526
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,6921028,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest8-blocksize8k-threads8-device1of5: (groupid=7, jobs=40): err= 0: pid=6856: Sat Jan 12 08:18:02 2019
  write: IOPS=126k, BW=985MiB/s (1033MB/s)(57.7GiB/60002msec)
    slat (nsec): min=1962, max=81785, avg=5246.90, stdev=2459.94
    clat (usec): min=57, max=76349, avg=311.18, stdev=317.76
     lat (usec): min=101, max=76351, avg=316.48, stdev=317.73
    clat percentiles (usec):
     |  1.00th=[  141],  5.00th=[  172], 10.00th=[  194], 20.00th=[  221],
     | 30.00th=[  235], 40.00th=[  249], 50.00th=[  265], 60.00th=[  281],
     | 70.00th=[  293], 80.00th=[  310], 90.00th=[  359], 95.00th=[  416],
     | 99.00th=[ 1926], 99.50th=[ 2180], 99.90th=[ 3326], 99.95th=[ 3949],
     | 99.99th=[ 6521]
   bw (  KiB/s): min=667184, max=1034478, per=79.65%, avg=803424.66, stdev=1999.36, samples=4762
   iops        : min=83386, max=129298, avg=100413.18, stdev=249.94, samples=4762
  lat (usec)   : 100=0.01%, 250=41.31%, 500=54.96%, 750=0.95%, 1000=0.15%
  lat (msec)   : 2=1.80%, 4=0.78%, 10=0.05%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.52%, sys=2.15%, ctx=7588495, majf=0, minf=591
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,7565305,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest9-blocksize8k-threads9-device1of5: (groupid=8, jobs=45): err= 0: pid=7223: Sat Jan 12 08:18:02 2019
  write: IOPS=137k, BW=1069MiB/s (1121MB/s)(62.7GiB/60003msec)
    slat (usec): min=2, max=106, avg= 5.10, stdev= 2.44
    clat (usec): min=57, max=70464, avg=322.84, stdev=315.47
     lat (usec): min=102, max=70468, avg=328.00, stdev=315.46
    clat percentiles (usec):
     |  1.00th=[  145],  5.00th=[  176], 10.00th=[  200], 20.00th=[  229],
     | 30.00th=[  247], 40.00th=[  262], 50.00th=[  277], 60.00th=[  289],
     | 70.00th=[  302], 80.00th=[  326], 90.00th=[  383], 95.00th=[  433],
     | 99.00th=[ 1958], 99.50th=[ 2212], 99.90th=[ 3163], 99.95th=[ 3556],
     | 99.99th=[ 5473]
   bw (  KiB/s): min=698644, max=1133284, per=78.33%, avg=857641.81, stdev=1894.13, samples=5358
   iops        : min=87314, max=141647, avg=107188.30, stdev=236.77, samples=5358
  lat (usec)   : 100=0.01%, 250=32.66%, 500=63.49%, 750=1.15%, 1000=0.09%
  lat (msec)   : 2=1.72%, 4=0.85%, 10=0.02%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.56%, sys=1.99%, ctx=8249250, majf=0, minf=665
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8212468,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest10-blocksize8k-threads10-device1of5: (groupid=9, jobs=50): err= 0: pid=7562: Sat Jan 12 08:18:02 2019
  write: IOPS=147k, BW=1149MiB/s (1205MB/s)(67.3GiB/60003msec)
    slat (usec): min=2, max=115, avg= 5.21, stdev= 2.54
    clat (usec): min=64, max=54045, avg=333.78, stdev=315.82
     lat (usec): min=102, max=54048, avg=339.05, stdev=315.82
    clat percentiles (usec):
     |  1.00th=[  149],  5.00th=[  180], 10.00th=[  204], 20.00th=[  235],
     | 30.00th=[  255], 40.00th=[  273], 50.00th=[  285], 60.00th=[  297],
     | 70.00th=[  314], 80.00th=[  343], 90.00th=[  392], 95.00th=[  449],
     | 99.00th=[ 1991], 99.50th=[ 2278], 99.90th=[ 3326], 99.95th=[ 3785],
     | 99.99th=[ 6587]
   bw (  MiB/s): min= 1060, max= 1220, per=99.99%, avg=1149.24, stdev= 0.58, samples=5958
   iops        : min=135690, max=156206, avg=147101.60, stdev=74.61, samples=5958
  lat (usec)   : 100=0.01%, 250=27.32%, 500=68.59%, 750=1.42%, 1000=0.09%
  lat (msec)   : 2=1.57%, 4=0.95%, 10=0.04%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.59%, sys=1.94%, ctx=8882551, majf=0, minf=731
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8827416,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=240MiB/s (252MB/s), 240MiB/s-240MiB/s (252MB/s-252MB/s), io=14.1GiB (15.1GB), run=60001-60001msec

Run status group 1 (all jobs):
  WRITE: bw=415MiB/s (435MB/s), 415MiB/s-415MiB/s (435MB/s-435MB/s), io=24.3GiB (26.1GB), run=60003-60003msec

Run status group 2 (all jobs):
  WRITE: bw=547MiB/s (573MB/s), 547MiB/s-547MiB/s (573MB/s-573MB/s), io=32.0GiB (34.4GB), run=60001-60001msec

Run status group 3 (all jobs):
  WRITE: bw=651MiB/s (682MB/s), 651MiB/s-651MiB/s (682MB/s-682MB/s), io=38.1GiB (40.9GB), run=60001-60001msec

Run status group 4 (all jobs):
  WRITE: bw=728MiB/s (763MB/s), 728MiB/s-728MiB/s (763MB/s-763MB/s), io=42.6GiB (45.8GB), run=60002-60002msec

Run status group 5 (all jobs):
  WRITE: bw=812MiB/s (852MB/s), 812MiB/s-812MiB/s (852MB/s-852MB/s), io=47.6GiB (51.1GB), run=60003-60003msec

Run status group 6 (all jobs):
  WRITE: bw=901MiB/s (945MB/s), 901MiB/s-901MiB/s (945MB/s-945MB/s), io=52.8GiB (56.7GB), run=60002-60002msec

Run status group 7 (all jobs):
  WRITE: bw=985MiB/s (1033MB/s), 985MiB/s-985MiB/s (1033MB/s-1033MB/s), io=57.7GiB (61.0GB), run=60002-60002msec

Run status group 8 (all jobs):
  WRITE: bw=1069MiB/s (1121MB/s), 1069MiB/s-1069MiB/s (1121MB/s-1121MB/s), io=62.7GiB (67.3GB), run=60003-60003msec

Run status group 9 (all jobs):
  WRITE: bw=1149MiB/s (1205MB/s), 1149MiB/s-1149MiB/s (1205MB/s-1205MB/s), io=67.3GiB (72.3GB), run=60003-60003msec

Disk stats (read/write):
    dm-21: ios=360/12499989, merge=0/0, ticks=237/3555942, in_queue=3562314, util=99.40%, aggrios=100/3125030, aggrmerge=0/0, aggrticks=71/842433, aggrin_queue=842303, aggrutil=91.56%
  sddk: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdcd: ios=200/6250060, merge=0/0, ticks=153/1686244, in_queue=1686012, util=91.56%
  sdaw: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdp: ios=200/6250061, merge=0/0, ticks=134/1683490, in_queue=1683203, util=91.50%
    dm-22: ios=360/12378093, merge=0/0, ticks=208/3551209, in_queue=3598946, util=100.00%, aggrios=100/3094553, aggrmerge=0/0, aggrticks=57/853185, aggrin_queue=853056, aggrutil=89.76%
  sdbb: ios=197/6189109, merge=0/0, ticks=113/1705157, in_queue=1704920, util=89.71%
  sdci: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdu: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sddp: ios=203/6189104, merge=0/0, ticks=117/1707584, in_queue=1707305, util=89.76%
    dm-23: ios=357/12507969, merge=0/0, ticks=199/3555980, in_queue=3563877, util=99.43%, aggrios=99/3127023, aggrmerge=0/0, aggrticks=53/841516, aggrin_queue=841356, aggrutil=91.39%
  sddq: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdbc: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdcj: ios=205/6254040, merge=0/0, ticks=113/1683948, in_queue=1683642, util=91.39%
  sdv: ios=192/6254053, merge=0/0, ticks=99/1682118, in_queue=1681782, util=91.34%
    dm-24: ios=359/12514799, merge=0/0, ticks=229/3551064, in_queue=3558007, util=99.41%, aggrios=99/3128734, aggrmerge=0/0, aggrticks=63/839992, aggrin_queue=839826, aggrutil=91.28%
  sdbk: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdcr: ios=192/6257477, merge=0/0, ticks=141/1679723, in_queue=1679364, util=91.28%
  sddy: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdad: ios=207/6257462, merge=0/0, ticks=111/1680248, in_queue=1679943, util=91.24%
    dm-25: ios=362/12514971, merge=0/0, ticks=215/3554638, in_queue=3560836, util=99.45%, aggrios=100/3128780, aggrmerge=0/0, aggrticks=61/841057, aggrin_queue=840897, aggrutil=91.59%
  sdab: ios=195/6257567, merge=0/0, ticks=117/1681042, in_queue=1680731, util=91.50%
  sdbi: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdcp: ios=207/6257555, merge=0/0, ticks=127/1683187, in_queue=1682858, util=91.59%
  sddw: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%